[
    {
        "id": 1,
        "img": "/assets/img/projets/kasa.png",
        "alt": "Image du site kasa",
        "description": "Kasa est une application web de location immobilière créée avec React, conçue pour être moderne et réactive. Le site propose une navigation fluide et une gestion optimisée des annonces. Chaque utilisateur peut ainsi naviguer et trouver la location qui lui plaît de façon simple et claire. Le site est codé avec React, utilisant Vite et TypeScript, il propose donc une rapidité et une fluidité très forte.",
        "langage": ["HTML/CSS", "javaScript", "SASS", "TypeScript", "React"],
        "logo": "/assets/img/projets/logo_kasa.png",
        "logoAlt": "logo kasa",
        "github": "https://github.com/Matthieu-Dv/kasa",
        "site": "",
        "type": "Front-End"
    },
    {
        "id": 2,
        "img": "/assets/img/projets/nina_carducci.png",
        "alt": "Image du site nina_carducci",
        "description": "Nina Carducci est un site web vitrine créé pour mettre en valeur les services de photographie professionnelle en Île-de-France. Réalisé avec React, ce projet se distingue par un travail approfondi sur la performance et l’accessibilité, assurant une expérience utilisateur optimale. J'ai mis en œuvre des pratiques avancées de SEO on-page, telles que l’optimisation des balises HTML, l’intégration de Schema.org et des métadonnées enrichies, notamment OpenGraph et Twitter Cards, pour maximiser la visibilité du site sur les moteurs de recherche et les réseaux sociaux. Par ailleurs, le projet respecte les meilleures pratiques en matière d’accessibilité, validées à l'aide de l'outil Wave, garantissant un site inclusif et facile d’accès pour tous les utilisateurs.",
        "langage": ["Référencement local", "SEO On-page", "Accessibilité","Réseaux sociaux", "Lighthouse"],
        "logo": "/assets/img/projets/logo_nina_carducci.png",
        "logoAlt": "logo nina_carducci",
        "github": "https://github.com/Matthieu-Dv/ninacarducci",
        "rapportOptimisation": "https://drive.google.com/file/d/1Tbz0hsGA29349KAPl6n52mpAMxH0GehT/view?usp=sharing",
        "type": "SEO"
    },
    {
        "id": 3,
        "img": "/assets/img/projets/kasa.png",
        "alt": "Image du site argent-bank",
        "description": "argent-bank",
        "langage": ["HTML/CSS", "javaScript", "SASS", "React", "Redux", "TypeScript"],
        "logo": "/assets/img/projets/logo_argent_bank.webp",
        "logoAlt": "logo argent-bank",
        "github": "https://github.com/Matthieu-Dv/argent-bank",
        "site": "",
        "type": "Front-End"
    },
    {
        "id": 4,
        "img": "/assets/img/projets/portfolio.png",
        "alt": "Image du site actuel portfolio",
        "description": "Ce portfolio est l'aboutissement d'une année de formation et d'apprentissage du métier d'Intégrateur Web. Il rassemble l'ensemble des compétences et des notions que j'ai acquises dans le développement web, en proposant un site simple, moderne et complet développé avec React. Optimisé pour la performance et conçu dans le respect des bonnes pratiques d'accessibilité, ce portfolio offre une navigation fluide et intuitive. Il reflète mon souci du détail, ma capacité à allier design et technique, ainsi que mon engagement à créer des expériences utilisateur claires et efficaces",
        "langage": ["HTML/CSS", "javaScript", "SASS", "JSX", "React", "Accessibilité", "SEO"],
        "logo": "/assets/img/projets/logo_portfolio.png",
        "logoAlt": "logo du portfolio",
        "github": "https://github.com/Matthieu-Dv/Portfolio",
        "site": "",
        "type": ["Front-End", "SEO"]
    }
]